tutorials/incompressible/simpleFoam/mixingPlaneAxial/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar>
2106
(
0.0923669
3.95235e-09
0.0923668
-8.45339e-10
0.0923668
3.16835e-09
0.0923667
-8.18978e-09
...
)
;

boundaryField
{
    outflow
    {
        type            calculated;
        value           nonuniform List<scalar>
27
(
0.0232702
0.0232702
0.0232702
0.0232702
0.0232702
0.0232702
0.0232702
0.0232702
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<scalar>
17
(
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
-0.0923669
)
;
    }
    upstreamPerio1
    {
        type            cyclicGgi;
        value           nonuniform List<scalar>
25
(
-3.3879e-11
-1.31983e-09
-1.75604e-08
5.27141e-09
-1.02796e-08
-9.79111e-09
2.59151e-09
-4.29919e-09
...
)
;
    }
    upstreamPerio2
    {
        type            cyclicGgi;
        value           nonuniform List<scalar>
25
(
3.42208e-10
1.30376e-09
1.75446e-08
-5.63949e-09
1.02644e-08
1.01165e-08
-2.60616e-09
4.28479e-09
...
)
;
    }
    upstreamMixingPlanePatch
    {
        type            mixingPlane;
        value           nonuniform List<scalar>
27
(
-0.02327
-0.02327
-0.02327
-0.02327
-0.02327
-0.02327
-0.02327
-0.02327
...
)
;
    }
    downstreamMixingPlanePatch
    {
        type            mixingPlane;
        value           nonuniform List<scalar>
17
(
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.0923649
0.092365
)
;
    }
    downstreamWall
    {
        type            symmetryPlane;
    }
    upstreamWall
    {
        type            symmetryPlane;
    }
    downstreamPerio1
    {
        type            cyclicGgi;
        value           nonuniform List<scalar>
25
(
-6.72617e-09
1.00031e-09
-5.51936e-09
-1.09217e-08
3.80039e-09
-1.91373e-08
1.82611e-10
-7.19369e-10
...
)
;
    }
    downstreamPerio2
    {
        type            cyclicGgi;
        value           nonuniform List<scalar>
25
(
6.72617e-09
-1.00031e-09
5.51936e-09
1.09217e-08
-3.80039e-09
1.91373e-08
-1.82611e-10
7.19369e-10
...
)
;
    }
}

// ************************************************************************* //
